microsoft/uf2-samdx1/lib/saml21/saml21a1/atdf/ATSAML21E18A.atdf
          <instance name="SERCOM2">
            <register-group name="SERCOM2" name-in-module="SERCOM" address-space="base" offset="0x42000800"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA08"/>
              <signal group="PAD" index="1" function="D" pad="PA09"/>
              <signal group="PAD" index="2" function="D" pad="PA10"/>
              <signal group="PAD" index="2" function="C" pad="PA14"/>
              <signal group="PAD" index="3" function="D" pad="PA11"/>
              <signal group="PAD" index="3" function="C" pad="PA15"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="5" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="6" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="20"/>
              <param name="GCLK_ID_SLOW" value="17"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="INSTANCE_ID" value="66"/>
            </parameters>
          </instance>
          <instance name="SERCOM3">
            <register-group name="SERCOM3" name-in-module="SERCOM" address-space="base" offset="0x42000C00"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA16"/>
              <signal group="PAD" index="0" function="C" pad="PA22"/>
              <signal group="PAD" index="0" function="F" pad="PA27"/>
              <signal group="PAD" index="1" function="D" pad="PA17"/>
              <signal group="PAD" index="1" function="C" pad="PA23"/>
              <signal group="PAD" index="2" function="D" pad="PA18"/>
              <signal group="PAD" index="2" function="C" pad="PA24"/>
              <signal group="PAD" index="3" function="D" pad="PA19"/>
              <signal group="PAD" index="3" function="C" pad="PA25"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="7" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="8" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="21"/>
              <param name="GCLK_ID_SLOW" value="17"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="INSTANCE_ID" value="67"/>
            </parameters>
          </instance>
        </module>
        <module name="SUPC" id="U2117" version="1.0.0">
          <instance name="SUPC">
            <register-group name="SUPC" name-in-module="SUPC" address-space="base" offset="0x40001400"/>
            <signals>
            </signals>
            <parameters>
              <param name="BOD12_CALIB_MSB" value="5"/>
              <param name="BOD33_CALIB_MSB" value="5"/>
              <param name="SUPC_OUT_NUM_MSB" value="1" caption="MSB of backup output pad Number"/>
              <param name="INSTANCE_ID" value="5"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="U2249" version="1.0.0">
          <instance name="TC0">
            <register-group name="TC0" name-in-module="TC" address-space="base" offset="0x42002000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA22"/>
              <signal group="WO" index="1" function="E" pad="PA23"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="22" caption="Indexes of DMA Overflow trigger"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="27"/>
              <param name="MASTER" value="1"/>
              <param name="OW_NUM" value="2"/>
              <param name="INSTANCE_ID" value="72"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x42002400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA24"/>
              <signal group="WO" index="1" function="E" pad="PA25"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="25" caption="Indexes of DMA Overflow trigger"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="27"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2"/>
              <param name="INSTANCE_ID" value="73"/>
            </parameters>
          </instance>
          <instance name="TC4">
            <register-group name="TC4" name-in-module="TC" address-space="base" offset="0x43000800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA18"/>
              <signal group="WO" index="0" function="E" pad="PA14"/>
              <signal group="WO" index="1" function="E" pad="PA19"/>
              <signal group="WO" index="1" function="E" pad="PA15"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="34" caption="Indexes of DMA Overflow trigger"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="29"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2"/>
              <param name="INSTANCE_ID" value="98"/>
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="U2213" version="2.0.0">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x42001400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA04"/>
              <signal group="WO" index="0" function="E" pad="PA08"/>
              <signal group="WO" index="0" function="F" pad="PA16"/>
              <signal group="WO" index="1" function="E" pad="PA05"/>
              <signal group="WO" index="1" function="E" pad="PA09"/>
              <signal group="WO" index="1" function="F" pad="PA17"/>
              <signal group="WO" index="2" function="F" pad="PA10"/>
              <signal group="WO" index="2" function="F" pad="PA18"/>
              <signal group="WO" index="3" function="F" pad="PA11"/>
              <signal group="WO" index="3" function="F" pad="PA19"/>
              <signal group="WO" index="4" function="F" pad="PA22"/>
              <signal group="WO" index="4" function="F" pad="PA14"/>
              <signal group="WO" index="5" function="F" pad="PA15"/>
              <signal group="WO" index="5" function="F" pad="PA23"/>
              <signal group="WO" index="6" function="F" pad="PA16"/>
              <signal group="WO" index="7" function="F" pad="PA17"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="4" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="11" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="EXT" value="31" caption="Coding of implemented extended features"/>
              <param name="GCLK_ID" value="25" caption="Index of Generic Clock"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="TYPE" value="1" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="INSTANCE_ID" value="69"/>
            </parameters>
          </instance>
          <instance name="TCC1">
            <register-group name="TCC1" name-in-module="TCC" address-space="base" offset="0x42001800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA06"/>
              <signal group="WO" index="0" function="E" pad="PA10"/>
              <signal group="WO" index="0" function="E" pad="PA30"/>
              <signal group="WO" index="1" function="E" pad="PA07"/>
              <signal group="WO" index="1" function="E" pad="PA11"/>
              <signal group="WO" index="1" function="E" pad="PA31"/>
              <signal group="WO" index="2" function="F" pad="PA08"/>
              <signal group="WO" index="2" function="F" pad="PA24"/>
              <signal group="WO" index="3" function="F" pad="PA09"/>
              <signal group="WO" index="3" function="F" pad="PA25"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="16" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented"/>
              <param name="EXT" value="24" caption="Coding of implemented extended features"/>
              <param name="GCLK_ID" value="25" caption="Index of Generic Clock"/>
              <param name="OTMX" value="0" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="4" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented"/>
              <param name="TYPE" value="2" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="INSTANCE_ID" value="70"/>
            </parameters>
          </instance>
