microsoft/uf2-samdx1/lib/saml21/saml21a1/atdf/ATSAML21E18A.atdf
        <register name="WAVEBUF" offset="0x68" rw="RW" size="4" initval="0x00000000" caption="Waveform Control Buffer">
          <bitfield name="WAVEGENB" caption="Waveform Generation Buffer" mask="0x7" values="TCC_WAVEBUF__WAVEGENB"/>
          <bitfield name="RAMPB" caption="Ramp Mode Buffer" mask="0x30"/>
          <bitfield name="CIPERENB" caption="Circular Period Enable Buffer" mask="0x80"/>
          <bitfield name="CICCENB0" caption="Circular Channel 0 Enable Buffer" mask="0x100"/>
          <bitfield name="CICCENB1" caption="Circular Channel 1 Enable Buffer" mask="0x200"/>
          <bitfield name="CICCENB2" caption="Circular Channel 2 Enable Buffer" mask="0x400"/>
          <bitfield name="CICCENB3" caption="Circular Channel 3 Enable Buffer" mask="0x800"/>
          <bitfield name="POLB0" caption="Channel 0 Polarity Buffer" mask="0x10000"/>
          <bitfield name="POLB1" caption="Channel 1 Polarity Buffer" mask="0x20000"/>
          <bitfield name="POLB2" caption="Channel 2 Polarity Buffer" mask="0x40000"/>
          <bitfield name="POLB3" caption="Channel 3 Polarity Buffer" mask="0x80000"/>
          <bitfield name="SWAPB0" caption="Swap DTI Output Pair 0 Buffer" mask="0x1000000"/>
          <bitfield name="SWAPB1" caption="Swap DTI Output Pair 1 Buffer" mask="0x2000000"/>
          <bitfield name="SWAPB2" caption="Swap DTI Output Pair 2 Buffer" mask="0x4000000"/>
          <bitfield name="SWAPB3" caption="Swap DTI Output Pair 3 Buffer" mask="0x8000000"/>
        </register>
        <register name="PERBUF" offset="0x6C" rw="RW" size="4" initval="0xFFFFFFFF" caption="Period Buffer">
          <mode name="DITH4"/>
          <mode name="DITH5"/>
          <mode name="DITH6"/>
          <mode name="DEFAULT"/>
          <bitfield modes="DITH4" name="DITHERBUF" caption="Dithering Buffer Cycle Number" mask="0xF"/>
          <bitfield modes="DITH5" name="DITHERBUF" caption="Dithering Buffer Cycle Number" mask="0x1F"/>
          <bitfield modes="DITH6" name="DITHERBUF" caption="Dithering Buffer Cycle Number" mask="0x3F"/>
          <bitfield modes="DITH6" name="PERBUF" caption="Period Buffer Value" mask="0xFFFFC0"/>
          <bitfield modes="DITH5" name="PERBUF" caption="Period Buffer Value" mask="0xFFFFE0"/>
          <bitfield modes="DITH4" name="PERBUF" caption="Period Buffer Value" mask="0xFFFFF0"/>
          <bitfield modes="DEFAULT" name="PERBUF" caption="Period Buffer Value" mask="0xFFFFFF"/>
        </register>
        <register name="CCBUF" offset="0x70" rw="RW" size="4" count="4" initval="0x00000000" caption="Compare and Capture Buffer">
          <mode name="DITH4"/>
          <mode name="DITH5"/>
          <mode name="DITH6"/>
          <mode name="DEFAULT"/>
          <bitfield modes="DITH4" name="CCBUF" caption="Channel Compare/Capture Buffer Value" mask="0xF"/>
          <bitfield modes="DITH5" name="DITHERBUF" caption="Dithering Buffer Cycle Number" mask="0x1F"/>
          <bitfield modes="DITH6" name="DITHERBUF" caption="Dithering Buffer Cycle Number" mask="0x3F"/>
          <bitfield modes="DITH6" name="CCBUF" caption="Channel Compare/Capture Buffer Value" mask="0xFFFFC0"/>
          <bitfield modes="DITH5" name="CCBUF" caption="Channel Compare/Capture Buffer Value" mask="0xFFFFE0"/>
          <bitfield modes="DITH4" name="DITHERBUF" caption="Dithering Buffer Cycle Number" mask="0xFFFFF0"/>
          <bitfield modes="DEFAULT" name="CCBUF" caption="Channel Compare/Capture Buffer Value" mask="0xFFFFFF"/>
        </register>
      </register-group>
      <value-group name="TCC_CTRLA__PRESCALER">
        <value name="DIV1" caption="No division" value="0"/>
        <value name="DIV2" caption="Divide by 2" value="1"/>
        <value name="DIV4" caption="Divide by 4" value="2"/>
        <value name="DIV8" caption="Divide by 8" value="3"/>
        <value name="DIV16" caption="Divide by 16" value="4"/>
        <value name="DIV64" caption="Divide by 64" value="5"/>
        <value name="DIV256" caption="Divide by 256" value="6"/>
        <value name="DIV1024" caption="Divide by 1024" value="7"/>
      </value-group>
      <value-group name="TCC_CTRLA__PRESCSYNC">
        <value name="GCLK" caption="Reload or reset counter on next GCLK" value="0"/>
        <value name="PRESC" caption="Reload or reset counter on next prescaler clock" value="1"/>
        <value name="RESYNC" caption="Reload or reset counter on next GCLK and reset prescaler counter" value="2"/>
      </value-group>
      <value-group name="TCC_CTRLA__RESOLUTION">
        <value name="NONE" caption="Dithering is disabled" value="0"/>
        <value name="DITH4" caption="Dithering is done every 16 PWM frames" value="1"/>
        <value name="DITH5" caption="Dithering is done every 32 PWM frames" value="2"/>
        <value name="DITH6" caption="Dithering is done every 64 PWM frames" value="3"/>
      </value-group>
      <value-group name="TCC_CTRLBCLR__CMD">
        <value name="NONE" caption="No action" value="0"/>
        <value name="RETRIGGER" caption="Clear start, restart or retrigger" value="1"/>
        <value name="STOP" caption="Force stop" value="2"/>
        <value name="UPDATE" caption="Force update or double buffered registers" value="3"/>
        <value name="READSYNC" caption="Force COUNT read synchronization" value="4"/>
      </value-group>
      <value-group name="TCC_CTRLBCLR__IDXCMD">
        <value name="DISABLE" caption="Command disabled: Index toggles between cycles A and B" value="0"/>
        <value name="SET" caption="Set index: cycle B will be forced in the next cycle" value="1"/>
        <value name="CLEAR" caption="Clear index: cycle A will be forced in the next cycle" value="2"/>
        <value name="HOLD" caption="Hold index: the next cycle will be the same as the current cycle" value="3"/>
      </value-group>
      <value-group name="TCC_CTRLBSET__CMD">
        <value name="NONE" caption="No action" value="0"/>
        <value name="RETRIGGER" caption="Clear start, restart or retrigger" value="1"/>
        <value name="STOP" caption="Force stop" value="2"/>
        <value name="UPDATE" caption="Force update or double buffered registers" value="3"/>
        <value name="READSYNC" caption="Force COUNT read synchronization" value="4"/>
      </value-group>
      <value-group name="TCC_CTRLBSET__IDXCMD">
        <value name="DISABLE" caption="Command disabled: Index toggles between cycles A and B" value="0"/>
        <value name="SET" caption="Set index: cycle B will be forced in the next cycle" value="1"/>
        <value name="CLEAR" caption="Clear index: cycle A will be forced in the next cycle" value="2"/>
        <value name="HOLD" caption="Hold index: the next cycle will be the same as the current cycle" value="3"/>
      </value-group>
      <value-group name="TCC_FCTRLA__BLANK">
        <value name="START" caption="Blanking applied from start of the ramp" value="0"/>
        <value name="RISE" caption="Blanking applied from rising edge of the output waveform" value="1"/>
        <value name="FALL" caption="Blanking applied from falling edge of the output waveform" value="2"/>
        <value name="BOTH" caption="Blanking applied from each toggle of the output waveform" value="3"/>
      </value-group>
      <value-group name="TCC_FCTRLA__CAPTURE">
        <value name="DISABLE" caption="No capture" value="0"/>
        <value name="CAPT" caption="Capture on fault" value="1"/>
        <value name="CAPTMIN" caption="Minimum capture" value="2"/>
        <value name="CAPTMAX" caption="Maximum capture" value="3"/>
        <value name="LOCMIN" caption="Minimum local detection" value="4"/>
        <value name="LOCMAX" caption="Maximum local detection" value="5"/>
        <value name="DERIV0" caption="Minimum and maximum local detection" value="6"/>
        <value name="CAPTMARK" caption="Capture with ramp index as MSB value" value="7"/>
      </value-group>
      <value-group name="TCC_FCTRLA__CHSEL">
        <value name="CC0" caption="Capture value stored in channel 0" value="0"/>
        <value name="CC1" caption="Capture value stored in channel 1" value="1"/>
        <value name="CC2" caption="Capture value stored in channel 2" value="2"/>
        <value name="CC3" caption="Capture value stored in channel 3" value="3"/>
      </value-group>
